Tekla Open API Reference for Tekla Structures 2025
WeldMark.Modify Method
 Modifies the weld mark in the current drawing database. Attributes can be modified with .wel setting files.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override bool Modify()
Public Overrides Function Modify As Boolean
Return Value
Type: Boolean
True on success.
See Also
Reference
WeldMark Class
Tekla.Structures.Drawing Namespace